chmod775/bittino-pi-cpy/ports/bittino-pi/boards/waveshare_rp2040_zero/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME "Waveshare RP2040-Zero"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_LED_STATUS (&pin_GPIO8)

// #define DEFAULT_UART_BUS_TX (&pin_GPIO0)
// #define DEFAULT_UART_BUS_RX (&pin_GPIO1)

// #define MICROPY_HW_NEOPIXEL (&pin_GPIO16)

#define CIRCUITPY_CONSOLE_UART_TX (&pin_GPIO0)
#define CIRCUITPY_CONSOLE_UART_RX (&pin_GPIO1)